export default function ChannelPage({ db, categoryId, showAll }) {

    const showOnPage = 5;

    const renderCards = () => {
    }

    return (
        <>
        <div className="channel-discription">
            <div className="channel-horizontal-menu">
                <nav className="channel-menu">
                    <ul>
                        <li className="channel-menu-first-button">Главная</li>
                        <li><a href="#">Описание</a></li>
                        <li><a href="#">Расписание</a></li>
                        <li><a href="#">Видео</a></li>
                        <li><a href="#">Чат</a></li>
                    </ul>
                </nav>
                <span>
                    {/* <!-- License: MIT. Made by Microsoft: https://github.com/microsoft/vscode-codicons --> */}
                    <svg width="16px" height="16px" viewBox="0 0 16 16"
                        xmlns="http://www.w3.org/2000/svg" fill="#CECED6">
                        <path
                            d="M14.88 4.78a3.489 3.489 0 0 0-.37-.9 3.24 3.24 0 0 0-.6-.79 3.78 3.78 0 0 0-1.21-.81 3.74 3.74 0 0 0-2.84 0 4 4 0 0 0-1.16.75l-.05.06-.65.65-.65-.65-.05-.06a4 4 0 0 0-1.16-.75 3.74 3.74 0 0 0-2.84 0 3.78 3.78 0 0 0-1.21.81 3.55 3.55 0 0 0-.97 1.69 3.75 3.75 0 0 0-.12 1c0 .317.04.633.12.94a4 4 0 0 0 .36.89 3.8 3.8 0 0 0 .61.79L8 14.31l5.91-5.91c.237-.233.44-.5.6-.79A3.578 3.578 0 0 0 15 5.78a3.747 3.747 0 0 0-.12-1zm-1 1.63a2.69 2.69 0 0 1-.69 1.21l-5.21 5.2-5.21-5.2a2.9 2.9 0 0 1-.44-.57 3 3 0 0 1-.27-.65 3.25 3.25 0 0 1-.08-.69A3.36 3.36 0 0 1 2.06 5a2.8 2.8 0 0 1 .27-.65c.12-.21.268-.4.44-.57a2.91 2.91 0 0 1 .89-.6 2.8 2.8 0 0 1 2.08 0c.33.137.628.338.88.59l1.36 1.37 1.36-1.37a2.72 2.72 0 0 1 .88-.59 2.8 2.8 0 0 1 2.08 0c.331.143.633.347.89.6.174.165.32.357.43.57a2.69 2.69 0 0 1 .35 1.34 2.6 2.6 0 0 1-.06.72h-.03z" />
                    </svg>
                    &nbsp;&nbsp;9,3 тыс. отслеживающих</span>
            </div>
            <div className="about">
                <div className="info-about">
                    <span>На данном канале транслируются записи о разработке игр:</span>
                    <span>От появления концепции до пошаговой реализации онлайн вместе со зрителями</span>
                    <span>Применяются различные подходы разработки, информация от авторов книг данной тематики,</span>
                    <span>а также возможности совершенствования и развития идей с помощью ИИ</span>
                </div>
                <div className="info-links">
                    <a href="#">
                        {/* <!-- License: MIT. Made by michaelampr: https://github.com/michaelampr/jam --> */}
                        <svg fill="#CECED6" width="16px" height="16px" viewBox="0 0 20 20"
                            xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M10,0 C15.5228475,0 20,4.4771525 20,10 C20,15.5228475 15.5228475,20 10,20 C4.4771525,20 0,15.5228475 0,10 C0,4.4771525 4.4771525,0 10,0 Z M14.4415206,6 C14.060553,6.00676048 13.476055,6.20741135 10.663148,7.36249773 C9.67796175,7.7670526 7.70897661,8.60437935 4.75619264,9.87447795 C4.27670659,10.0627254 4.02553067,10.2468857 4.00266485,10.4269588 C3.95876487,10.7726802 4.46291296,10.8803081 5.09723696,11.0838761 C5.61440201,11.2498453 6.31007997,11.4440124 6.67173438,11.4517262 C6.99978943,11.4587234 7.36593635,11.3251987 7.77017511,11.051152 C10.5290529,9.21254679 11.9531977,8.28322679 12.0426094,8.26319203 C12.1056879,8.24905787 12.1930992,8.23128593 12.2523244,8.28325656 C12.3115496,8.33522719 12.3057275,8.43364956 12.299454,8.46005377 C12.2492926,8.67117474 9.65764825,10.998457 9.50849738,11.1513987 L9.43697409,11.2233057 C8.88741493,11.7661123 8.33196049,12.1205055 9.290333,12.7440164 C10.155665,13.3069957 10.6592923,13.6661378 11.5507686,14.2430701 C12.1204738,14.6117635 12.5671299,15.0489784 13.1553348,14.9955401 C13.4259939,14.9709508 13.705567,14.7196888 13.8475521,13.9703127 C14.1831052,12.1993135 14.8426779,8.36209709 14.9951103,6.78087197 C15.0084653,6.64233621 14.9916649,6.46503787 14.9781732,6.38720805 C14.9646815,6.30937823 14.9364876,6.19848702 14.8340164,6.11639754 C14.7126597,6.01917896 14.5253109,5.99867765 14.4415206,6 Z" />
                        </svg>
                        &nbsp;Telegram
                    </a>
                    <a href="#">
                        {/* <!-- License: Logo. --> */}
                        <svg fill="#CECED6" height="16px" width="16px" version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" 
                            viewBox="-143 145 512 512" xml:space="preserve">
                        <g>
                            <path d="M113,145c-141.4,0-256,114.6-256,256s114.6,256,256,256s256-114.6,256-256S254.4,145,113,145z M272.8,560.7
                                c-20.8,20.8-44.9,37.1-71.8,48.4c-27.8,11.8-57.4,17.7-88,17.7c-30.5,0-60.1-6-88-17.7c-26.9-11.4-51.1-27.7-71.8-48.4
                                c-20.8-20.8-37.1-44.9-48.4-71.8C-107,461.1-113,431.5-113,401s6-60.1,17.7-88c11.4-26.9,27.7-51.1,48.4-71.8
                                c20.9-20.8,45-37.1,71.9-48.5C52.9,181,82.5,175,113,175s60.1,6,88,17.7c26.9,11.4,51.1,27.7,71.8,48.4
                                c20.8,20.8,37.1,44.9,48.4,71.8c11.8,27.8,17.7,57.4,17.7,88c0,30.5-6,60.1-17.7,88C309.8,515.8,293.5,540,272.8,560.7z"/>
                            <path d="M196.9,311.2H29.1c0,0-44.1,0-44.1,44.1v91.5c0,0,0,44.1,44.1,44.1h167.8c0,0,44.1,0,44.1-44.1v-91.5
                                C241,355.3,241,311.2,196.9,311.2z M78.9,450.3v-98.5l83.8,49.3L78.9,450.3z"/>
                        </g>
                        </svg>
                        &nbsp;YouTube
                    </a>
                    <a href="#">
                        {/* <!-- License: Apache. Made by Iconscout: https://github.com/Iconscout/unicons --> */}
                        <svg fill="#CECED6" width="16px" height="16px" viewBox="0 0 24 24"
                            xmlns="http://www.w3.org/2000/svg" data-name="Layer 1">
                            <path
                                d="M12,2.2467A10.00042,10.00042,0,0,0,8.83752,21.73419c.5.08752.6875-.21247.6875-.475,0-.23749-.01251-1.025-.01251-1.86249C7,19.85919,6.35,18.78423,6.15,18.22173A3.636,3.636,0,0,0,5.125,16.8092c-.35-.1875-.85-.65-.01251-.66248A2.00117,2.00117,0,0,1,6.65,17.17169a2.13742,2.13742,0,0,0,2.91248.825A2.10376,2.10376,0,0,1,10.2,16.65923c-2.225-.25-4.55-1.11254-4.55-4.9375a3.89187,3.89187,0,0,1,1.025-2.6875,3.59373,3.59373,0,0,1,.1-2.65s.83747-.26251,2.75,1.025a9.42747,9.42747,0,0,1,5,0c1.91248-1.3,2.75-1.025,2.75-1.025a3.59323,3.59323,0,0,1,.1,2.65,3.869,3.869,0,0,1,1.025,2.6875c0,3.83747-2.33752,4.6875-4.5625,4.9375a2.36814,2.36814,0,0,1,.675,1.85c0,1.33752-.01251,2.41248-.01251,2.75,0,.26251.1875.575.6875.475A10.0053,10.0053,0,0,0,12,2.2467Z" />
                        </svg>
                        &nbsp;GitHub
                    </a>
                </div>
            </div>
            <div className="info-blocks-row">
                <div className="channel-info-block">
                    <img className="channel-images" src="./img/channel-image-1.jpg" alt="channel-images" />
                    <h3>Специализированные компоненты и оборудование:</h3>
                    <p>
                        Стример использует следующие <br/>
                        специализированные компоненты и оборудование: <br/>
                        &oplus; лазерные передатчики и приёмники, <br/>
                        &oplus; системы наведения и стабилизации  <br/>
                        с высокоточными подвижными зеркалами и оптическими системами,  <br/>
                        &oplus; детекторы фотонов: однофотонные детекторы (SNSPD), <br/>
                        &oplus; ретрансляторы, <br/>
                        &oplus; бортовые компьютеры и модемы: оптический модуль MAScOT и модем, <br/>
                        &oplus; защитные корпуса для камер и оборудования <br/>
                        &oplus; и, разумеется, подключение к «интернету Солнечной системы» <br/>
                    </p>
                </div>
                <div className="channel-info-block">
                    <img className="channel-images" src="./img/channel-image-2.jpg" alt="channel-images" />
                    <h3>Контакты для сотрудничества</h3>
                    <p>
                        Если хотите наладить контакт со стримером<br/>
                        через проекты сотрудничества<br/>
                        и взаимодействия <br/>
                        присылайте свои пробные проекты <br/>
                        в нейросетевую ЛС для одобрения: <br/>
                        neuro_activate: 0xAB3F9C2D@moon <br/>
                        &asymp;	&asymp;	&asymp; <br/>
                        для телепортации в виртуальной среде:<br/>
                        metaverse:moonland:zone3:x128y45z200<br/>
                        vrchat:worldID:portal7<br/>
                        &asymp;	&asymp;	&asymp; <br/>
                        от вашего AI-ассистента к AI-агенту стримера:<br/>
                        "primary_ai": "neuro_activate_ai_core_v3.2", <br/>
                        "chat_bot": "neuro_activate_chat_bot_v1.8",<br/>
                        "wss://chat.neuro_activate.ai/ws" <br/>
                        "preferred_modes": ["text", "voice", "vr_gesture"]
                    </p>
                </div>
                <div className="channel-info-block">
                    <img className="channel-images" src="./img/channel-image-3.jpg" alt="channel-images" />
                    <h3>LunaBoard</h3>
                    <p>
                        Вы можете порисовать в новой игре <br/>
                        на общем холсте для галереи «КосмоАрт‑хаб»<br/>
                        лучшие работы будут нарисованы <br/> 
                        &otimes; взвешенным пигментом, <br/>
                        &otimes; ферромагнитными частицами, <br/>
                        &otimes; воздействием радиации, <br/>
                        &otimes; звездным светом <br/>
                        &otimes; с использованием многомерных технологий <br/>
                        и доставлены роботом в галерею «КосмоАрт‑хаб» под прозрачным куполом <br/>
                        с уникальным видом на Землю <br/>
                        по адресу:  CosmoArtHub.space  &asymp; <br/>
                        CosmoArtHub-gallery.cosmos <br/>
                        Посмотреть все работы участников можно  <br/>
                        в нашей группе "LunaBoard"  <br/>
                        
                    </p>
                </div>
            </div>
        </div>
        </>
    );
}